of90/tutorials/rheoInterFoam/DieSwell/CarreauYasuda/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   inlet
    {
      type            zeroGradient;
    }
    
    outlet
    {
       type           zeroGradient;
    }
    
    wallIn
    {
        type          zeroGradient;
    }
    
    wallOut
    {
       type           zeroGradient;
    }
    
    atmosphere
    {
       type           fixedValue;
       value          uniform 0;
    }
    
    symmetry
    {
       type           symmetryPlane;
    }
}
